# Даны несколько списков: [-8, 1, 2, -2, 0], [1, -1, 0, -9, 4, -5], [1, 4, 0, 23, 6, 34].
# Для каждого из списков найти второе наименьшее значение в нем (правильные ответы выделены жирным шрифтом).

num1 = [-8, 1, 2, -2, 0]
num2 = [1, -1, 0, -9, 4, -5]
num3 = [1, 4, 0, 23, 6, 34]
num1.sort()
print(f'Второе наименьшее значение')