# 1) Создать произвольный словарь 2. Добавить новый элемент с ключом типа str и значением типа int 3. Добавить новый элемент
# с ключом типа кортеж(tuple) и значением типа список(list) 4. Получить элемент по ключу 5. Удалить элемент по ключу 6.
# Получить список ключей словаря.


dict1 = {'Wither': 'Geralt', 'Graf': 'Dracula', '1452': '1519', 'Coriolan': 'Rome'}
print(dict1)
dict1['str'] = 1833
print(dict1)
dict1[0,1,-1,-2] = ('look me')
print(dict1)
print(dict1['1452'])
print(dict1.pop('Coriolan'))
print(dict1.keys())













