# 4) Дано три числа. Найти количество положительных чисел среди них

a = int(input('Введите первое число: '))
b = int(input('Введите второе число: '))
c = int(input('Введите третье число: '))
d = 0
print(a > d)
print(b > d)
print(c > d)




