# 9. Джейден Смит, сын Уилла Смита. Является звездой таких фильмов как "каратэ-пацан"(2010) и "После нашей Земли"(2013).
# Джейден также известен своей философией которую он распространяет через Twitter, он известен тем, что почти всегда пишет
# каждое слово с большой буквы. Для простоты вам придется писать каждое слово с заглавной буквы. Посмотрите какими должны
# быть сокращения в преведенном ниже примере.
# Ваша задача состоит в том, чтобы преобразовать строки в то, как они былибы написаны Джейденом Смитом. Строки являются
# настоящими цитатами Джейдена Смита, но они не написаны с заглавной буквы так, как он их изначально напечатал.
# Пример:
# Not Jaden-Cased: 'How can mirrors be real if out eyes aren't real'
# Jaden-Cased: 'How Can Mirrors Be Real If Out Eyes Aren't Real'



Citata1 = "How can mirrors be real if out eyes aren't real"
print(Citata1.title())














