#1. Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.
num1 = int(input("Введите первое число"))
num2 = int(input("Введите второе число"))
result1 = num1 + num2
result2 = num1 - num2
result3 = num1 * num2
print(result1)
print(result2)
print(result3)