#3. Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности.
a = float(input("Введите длину ребра куба"))
b = a ** 3 #объем
c = (4 * a) #площадь
print(b)
print(c)
